###############################################################
#  Generated by:      Cadence Innovus 21.11-s130_1
#  OS:                Linux x86_64(Host ID et4351.ewi.tudelft.nl)
<<<<<<< Updated upstream
#  Generated on:      Wed Apr  8 20:01:13 2026
=======
#  Generated on:      Thu Apr  9 00:05:50 2026
>>>>>>> Stashed changes
#  Design:            et4351
#  Command:           routeDesign -globalDetail
###############################################################
current_design et4351
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 83.330000 -waveform {0.000000 41.665000}
create_generated_clock -name flash_clk -source [get_ports {clk}] -divide_by 2 [get_ports {flash_clk}]
set_propagated_clock  [get_ports {flash_clk}]
set_propagated_clock  [get_ports {clk}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -min -pin Y [get_ports {clk}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -min -pin Y [get_ports {clk}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -max -pin Y [get_ports {clk}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -max -pin Y [get_ports {clk}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -min -pin Y [get_ports {resetn}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -min -pin Y [get_ports {resetn}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -max -pin Y [get_ports {resetn}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -max -pin Y [get_ports {resetn}]
set_load -pin_load -max  0.05  [get_ports {ser_tx}]
set_load -pin_load -min  0.05  [get_ports {ser_tx}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -min -pin Y [get_ports {ser_rx}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -min -pin Y [get_ports {ser_rx}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -max -pin Y [get_ports {ser_rx}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -max -pin Y [get_ports {ser_rx}]
set_load -pin_load -max  0.05  [get_ports {flash_csb}]
set_load -pin_load -min  0.05  [get_ports {flash_csb}]
set_load -pin_load -max  0.05  [get_ports {flash_clk}]
set_load -pin_load -min  0.05  [get_ports {flash_clk}]
set_load -pin_load -max  0.05  [get_ports {flash_io0}]
set_load -pin_load -min  0.05  [get_ports {flash_io0}]
set_load -pin_load -max  0.05  [get_ports {flash_io1}]
set_load -pin_load -min  0.05  [get_ports {flash_io1}]
set_load -pin_load -max  0.05  [get_ports {flash_io2}]
set_load -pin_load -min  0.05  [get_ports {flash_io2}]
set_load -pin_load -max  0.05  [get_ports {flash_io3}]
set_load -pin_load -min  0.05  [get_ports {flash_io3}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -min -pin Y [get_ports {flash_io3}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -min -pin Y [get_ports {flash_io3}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -max -pin Y [get_ports {flash_io3}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -max -pin Y [get_ports {flash_io3}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -min -pin Y [get_ports {flash_io2}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -min -pin Y [get_ports {flash_io2}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -max -pin Y [get_ports {flash_io2}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -max -pin Y [get_ports {flash_io2}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -min -pin Y [get_ports {flash_io1}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -min -pin Y [get_ports {flash_io1}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -max -pin Y [get_ports {flash_io1}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -max -pin Y [get_ports {flash_io1}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -min -pin Y [get_ports {flash_io0}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -min -pin Y [get_ports {flash_io0}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -max -pin Y [get_ports {flash_io0}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -max -pin Y [get_ports {flash_io0}]
set_max_transition 0.28  [get_designs {et4351}]
set_input_delay -add_delay 20.8325 -min -clock [get_clocks {flash_clk}] [get_ports {flash_io1}]
set_input_delay -add_delay 25.8325 -max -clock [get_clocks {flash_clk}] [get_ports {flash_io1}]
set_input_delay -add_delay 20.8325 -min -clock [get_clocks {flash_clk}] [get_ports {flash_io2}]
set_input_delay -add_delay 25.8325 -max -clock [get_clocks {flash_clk}] [get_ports {flash_io2}]
set_input_delay -add_delay 20.8325 -min -clock [get_clocks {flash_clk}] [get_ports {flash_io3}]
set_input_delay -add_delay 25.8325 -max -clock [get_clocks {flash_clk}] [get_ports {flash_io3}]
set_input_delay -add_delay 20.8325 -min -clock [get_clocks {flash_clk}] [get_ports {flash_io0}]
set_input_delay -add_delay 25.8325 -max -clock [get_clocks {flash_clk}] [get_ports {flash_io0}]
set_output_delay -add_delay 0 -min -clock [get_clocks {flash_clk}] [get_ports {flash_io1}]
set_output_delay -add_delay 5 -max -clock [get_clocks {flash_clk}] [get_ports {flash_io1}]
set_output_delay -add_delay 0 -min -clock [get_clocks {flash_clk}] [get_ports {flash_csb}]
set_output_delay -add_delay 5 -max -clock [get_clocks {flash_clk}] [get_ports {flash_csb}]
set_output_delay -add_delay 0 -min -clock [get_clocks {flash_clk}] [get_ports {flash_io2}]
set_output_delay -add_delay 5 -max -clock [get_clocks {flash_clk}] [get_ports {flash_io2}]
set_output_delay -add_delay 0 -min -clock [get_clocks {flash_clk}] [get_ports {flash_io3}]
set_output_delay -add_delay 5 -max -clock [get_clocks {flash_clk}] [get_ports {flash_io3}]
set_output_delay -add_delay 0 -min -clock [get_clocks {flash_clk}] [get_ports {flash_io0}]
set_output_delay -add_delay 5 -max -clock [get_clocks {flash_clk}] [get_ports {flash_io0}]
set_clock_uncertainty 0.1 [get_clocks {flash_clk}]
set_clock_uncertainty 0.1 [get_clocks {clk}]
set_false_path  -to [get_ports {ser_tx}] 
set_false_path  -from [get_ports {resetn ser_rx}] 
<<<<<<< Updated upstream
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFHQX1}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFX2}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFSRX1}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFRHQX8}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SMDFFHQX1}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFXL}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFHQX4}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFSRX4}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFRX2}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SMDFFHQX4}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SEDFFHQX2}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFNSRX1}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFSX1}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFRXL}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SEDFFHQX8}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFNSRX4}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFSX4}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFSHQX2}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SEDFFTRX2}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFQX1}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFTRX1}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFSHQX8}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SEDFFTRXL}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFQX4}]
=======
>>>>>>> Stashed changes
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFTRX4}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFSRHQX2}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SEDFFX2}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFRHQX1}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFX1}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFSRHQX8}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SEDFFXL}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFRHQX4}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFHQX2}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFX4}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFSRX2}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SMDFFHQX2}]
<<<<<<< Updated upstream
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFRX1}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFHQX8}]
=======
>>>>>>> Stashed changes
set_dont_use  [get_lib_cells {slow_vdd1v0/SEDFFHQX1}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFHQX8}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFSRXL}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFRX4}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SMDFFHQX8}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SEDFFHQX4}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFNSRX2}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFSX2}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFSHQX1}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SEDFFTRX1}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFNSRXL}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFSXL}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFSHQX4}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SEDFFTRX4}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFQX2}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFTRX2}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFSRHQX1}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SEDFFX1}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFQXL}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFTRXL}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFSRHQX4}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SEDFFX4}]
<<<<<<< Updated upstream
=======
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFRHQX2}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFHQX1}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFX2}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFSRX1}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFRHQX8}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SMDFFHQX1}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFHQX4}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFXL}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFSRX4}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFRX2}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SMDFFHQX4}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFNSRX1}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SEDFFHQX2}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFSX1}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFRXL}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFNSRX4}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SEDFFHQX8}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFSX4}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFSHQX2}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFQX1}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SEDFFTRX2}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFTRX1}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFSHQX8}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SDFFQX4}]
set_dont_use  [get_lib_cells {slow_vdd1v0/SEDFFTRXL}]
>>>>>>> Stashed changes
