###############################################################
#  Generated by:      Cadence Innovus 21.11-s130_1
#  OS:                Linux x86_64(Host ID et4351.ewi.tudelft.nl)
#  Generated on:      Thu Apr  9 22:41:30 2026
#  Design:            et4351
#  Command:           routeDesign -globalDetail
###############################################################
current_design et4351
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 83.330000 -waveform {0.000000 41.665000}
create_generated_clock -name flash_clk -source [get_ports {clk}] -divide_by 2 [get_ports {flash_clk}]
set_propagated_clock  [get_ports {flash_clk}]
set_propagated_clock  [get_ports {clk}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -min -pin Y [get_ports {clk}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -min -pin Y [get_ports {clk}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -max -pin Y [get_ports {clk}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -max -pin Y [get_ports {clk}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -min -pin Y [get_ports {resetn}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -min -pin Y [get_ports {resetn}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -max -pin Y [get_ports {resetn}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -max -pin Y [get_ports {resetn}]
set_load -pin_load -max  0.05  [get_ports {ser_tx}]
set_load -pin_load -min  0.05  [get_ports {ser_tx}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -min -pin Y [get_ports {ser_rx}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -min -pin Y [get_ports {ser_rx}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -max -pin Y [get_ports {ser_rx}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -max -pin Y [get_ports {ser_rx}]
set_load -pin_load -max  0.05  [get_ports {flash_csb}]
set_load -pin_load -min  0.05  [get_ports {flash_csb}]
set_load -pin_load -max  0.05  [get_ports {flash_clk}]
set_load -pin_load -min  0.05  [get_ports {flash_clk}]
set_load -pin_load -max  0.05  [get_ports {flash_io0}]
set_load -pin_load -min  0.05  [get_ports {flash_io0}]
set_load -pin_load -max  0.05  [get_ports {flash_io1}]
set_load -pin_load -min  0.05  [get_ports {flash_io1}]
set_load -pin_load -max  0.05  [get_ports {flash_io2}]
set_load -pin_load -min  0.05  [get_ports {flash_io2}]
set_load -pin_load -max  0.05  [get_ports {flash_io3}]
set_load -pin_load -min  0.05  [get_ports {flash_io3}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -min -pin Y [get_ports {flash_io3}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -min -pin Y [get_ports {flash_io3}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -max -pin Y [get_ports {flash_io3}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -max -pin Y [get_ports {flash_io3}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -min -pin Y [get_ports {flash_io2}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -min -pin Y [get_ports {flash_io2}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -max -pin Y [get_ports {flash_io2}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -max -pin Y [get_ports {flash_io2}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -min -pin Y [get_ports {flash_io1}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -min -pin Y [get_ports {flash_io1}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -max -pin Y [get_ports {flash_io1}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -max -pin Y [get_ports {flash_io1}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -min -pin Y [get_ports {flash_io0}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -min -pin Y [get_ports {flash_io0}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -rise -max -pin Y [get_ports {flash_io0}]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -fall -max -pin Y [get_ports {flash_io0}]
set_max_transition 0.28  [get_designs {et4351}]
set_input_delay -add_delay 20.8325 -min -clock [get_clocks {flash_clk}] [get_ports {flash_io1}]
set_input_delay -add_delay 25.8325 -max -clock [get_clocks {flash_clk}] [get_ports {flash_io1}]
set_input_delay -add_delay 20.8325 -min -clock [get_clocks {flash_clk}] [get_ports {flash_io2}]
set_input_delay -add_delay 25.8325 -max -clock [get_clocks {flash_clk}] [get_ports {flash_io2}]
set_input_delay -add_delay 20.8325 -min -clock [get_clocks {flash_clk}] [get_ports {flash_io3}]
set_input_delay -add_delay 25.8325 -max -clock [get_clocks {flash_clk}] [get_ports {flash_io3}]
set_input_delay -add_delay 20.8325 -min -clock [get_clocks {flash_clk}] [get_ports {flash_io0}]
set_input_delay -add_delay 25.8325 -max -clock [get_clocks {flash_clk}] [get_ports {flash_io0}]
set_output_delay -add_delay 0 -min -clock [get_clocks {flash_clk}] [get_ports {flash_io1}]
set_output_delay -add_delay 5 -max -clock [get_clocks {flash_clk}] [get_ports {flash_io1}]
set_output_delay -add_delay 0 -min -clock [get_clocks {flash_clk}] [get_ports {flash_csb}]
set_output_delay -add_delay 5 -max -clock [get_clocks {flash_clk}] [get_ports {flash_csb}]
set_output_delay -add_delay 0 -min -clock [get_clocks {flash_clk}] [get_ports {flash_io2}]
set_output_delay -add_delay 5 -max -clock [get_clocks {flash_clk}] [get_ports {flash_io2}]
set_output_delay -add_delay 0 -min -clock [get_clocks {flash_clk}] [get_ports {flash_io3}]
set_output_delay -add_delay 5 -max -clock [get_clocks {flash_clk}] [get_ports {flash_io3}]
set_output_delay -add_delay 0 -min -clock [get_clocks {flash_clk}] [get_ports {flash_io0}]
set_output_delay -add_delay 5 -max -clock [get_clocks {flash_clk}] [get_ports {flash_io0}]
set_clock_uncertainty 0.1 [get_clocks {flash_clk}]
set_clock_uncertainty 0.1 [get_clocks {clk}]
set_false_path  -to [get_ports {ser_tx}] 
set_false_path  -from [get_ports {resetn ser_rx}] 
set __coll_3 [get_pins {{soc/cpu/genblk1.pcpi_mul/rd_reg_0_/RN} {soc/cpu/genblk1.pcpi_mul/rd_reg_4_/RN} {soc/cpu/genblk1.pcpi_mul/rd_reg_8_/RN} {soc/cpu/genblk1.pcpi_mul/rd_reg_12_/RN} {soc/cpu/genblk1.pcpi_mul/rd_reg_16_/RN} {soc/cpu/genblk1.pcpi_mul/rd_reg_20_/RN} {soc/cpu/genblk1.pcpi_mul/rd_reg_24_/RN} {soc/cpu/genblk1.pcpi_mul/rd_reg_28_/RN} {soc/cpu/genblk1.pcpi_mul/rd_reg_32_/RN} {soc/cpu/genblk1.pcpi_mul/rd_reg_36_/RN} {soc/cpu/genblk1.pcpi_mul/rd_reg_40_/RN} {soc/cpu/genblk1.pcpi_mul/rd_reg_44_/RN} {soc/cpu/genblk1.pcpi_mul/rd_reg_48_/RN} {soc/cpu/genblk1.pcpi_mul/rd_reg_52_/RN} {soc/cpu/genblk1.pcpi_mul/rd_reg_56_/RN} {soc/cpu/genblk1.pcpi_mul/rd_reg_60_/RN} {soc/cpu/genblk1.pcpi_mul/rdx_reg_4_/RN} {soc/cpu/genblk1.pcpi_mul/rdx_reg_8_/RN} {soc/cpu/genblk1.pcpi_mul/rdx_reg_12_/RN} {soc/cpu/genblk1.pcpi_mul/rdx_reg_16_/RN} {soc/cpu/genblk1.pcpi_mul/rdx_reg_20_/RN} {soc/cpu/genblk1.pcpi_mul/rdx_reg_24_/RN} {soc/cpu/genblk1.pcpi_mul/rdx_reg_28_/RN} {soc/cpu/genblk1.pcpi_mul/rdx_reg_32_/RN} {soc/cpu/genblk1.pcpi_mul/rdx_reg_36_/RN} {soc/cpu/genblk1.pcpi_mul/rdx_reg_40_/RN} {soc/cpu/genblk1.pcpi_mul/rdx_reg_44_/RN} {soc/cpu/genblk1.pcpi_mul/rdx_reg_48_/RN} {soc/cpu/genblk1.pcpi_mul/rdx_reg_52_/RN} {soc/cpu/genblk1.pcpi_mul/rdx_reg_56_/RN} {soc/cpu/genblk1.pcpi_mul/rdx_reg_60_/RN} soc/cpu/count_cycle_reg_1_/RN soc/cpu/count_cycle_reg_2_/RN soc/cpu/count_cycle_reg_3_/RN soc/cpu/count_cycle_reg_4_/RN soc/cpu/count_cycle_reg_5_/RN soc/cpu/count_cycle_reg_6_/RN soc/cpu/count_cycle_reg_7_/RN soc/cpu/count_cycle_reg_8_/RN soc/cpu/count_cycle_reg_9_/RN soc/cpu/count_cycle_reg_10_/RN soc/cpu/count_cycle_reg_11_/RN soc/cpu/count_cycle_reg_12_/RN soc/cpu/count_cycle_reg_13_/RN soc/cpu/count_cycle_reg_14_/RN soc/cpu/count_cycle_reg_15_/RN soc/cpu/count_cycle_reg_16_/RN soc/cpu/count_cycle_reg_17_/RN soc/cpu/count_cycle_reg_18_/RN soc/cpu/count_cycle_reg_19_/RN soc/cpu/count_cycle_reg_20_/RN soc/cpu/count_cycle_reg_21_/RN soc/cpu/count_cycle_reg_22_/RN soc/cpu/count_cycle_reg_23_/RN soc/cpu/count_cycle_reg_24_/RN soc/cpu/count_cycle_reg_25_/RN soc/cpu/count_cycle_reg_26_/RN soc/cpu/count_cycle_reg_27_/RN soc/cpu/count_cycle_reg_28_/RN soc/cpu/count_cycle_reg_29_/RN soc/cpu/count_cycle_reg_30_/RN soc/cpu/count_cycle_reg_31_/RN soc/cpu/count_cycle_reg_32_/RN soc/cpu/count_cycle_reg_33_/RN soc/cpu/count_cycle_reg_34_/RN soc/cpu/count_cycle_reg_35_/RN soc/cpu/count_cycle_reg_36_/RN soc/cpu/count_cycle_reg_37_/RN soc/cpu/count_cycle_reg_38_/RN soc/cpu/count_cycle_reg_39_/RN soc/cpu/count_cycle_reg_40_/RN soc/cpu/count_cycle_reg_41_/RN soc/cpu/count_cycle_reg_42_/RN soc/cpu/count_cycle_reg_43_/RN soc/cpu/count_cycle_reg_44_/RN soc/cpu/count_cycle_reg_45_/RN soc/cpu/count_cycle_reg_46_/RN soc/cpu/count_cycle_reg_47_/RN soc/cpu/count_cycle_reg_48_/RN soc/cpu/count_cycle_reg_49_/RN soc/cpu/count_cycle_reg_50_/RN soc/cpu/count_cycle_reg_51_/RN soc/cpu/count_cycle_reg_52_/RN soc/cpu/count_cycle_reg_53_/RN soc/cpu/count_cycle_reg_54_/RN soc/cpu/count_cycle_reg_55_/RN soc/cpu/count_cycle_reg_56_/RN soc/cpu/count_cycle_reg_57_/RN soc/cpu/count_cycle_reg_58_/RN soc/cpu/count_cycle_reg_59_/RN soc/cpu/count_cycle_reg_60_/RN soc/cpu/count_cycle_reg_61_/RN soc/cpu/count_cycle_reg_62_/RN soc/cpu/count_instr_reg_0_/RN soc/cpu/count_instr_reg_1_/RN soc/cpu/count_instr_reg_2_/RN soc/cpu/count_instr_reg_3_/RN soc/cpu/count_instr_reg_4_/RN soc/cpu/count_instr_reg_5_/RN soc/cpu/count_instr_reg_6_/RN soc/cpu/count_instr_reg_7_/RN soc/cpu/count_instr_reg_8_/RN soc/cpu/count_instr_reg_9_/RN soc/cpu/count_instr_reg_10_/RN soc/cpu/count_instr_reg_11_/RN soc/cpu/count_instr_reg_12_/RN soc/cpu/count_instr_reg_13_/RN soc/cpu/count_instr_reg_14_/RN soc/cpu/count_instr_reg_15_/RN soc/cpu/count_instr_reg_16_/RN soc/cpu/count_instr_reg_17_/RN soc/cpu/count_instr_reg_18_/RN soc/cpu/count_instr_reg_19_/RN soc/cpu/count_instr_reg_20_/RN soc/cpu/count_instr_reg_21_/RN soc/cpu/count_instr_reg_22_/RN soc/cpu/count_instr_reg_23_/RN soc/cpu/count_instr_reg_24_/RN soc/cpu/count_instr_reg_25_/RN soc/cpu/count_instr_reg_26_/RN soc/cpu/count_instr_reg_27_/RN soc/cpu/count_instr_reg_28_/RN soc/cpu/count_instr_reg_29_/RN soc/cpu/count_instr_reg_30_/RN soc/cpu/count_instr_reg_31_/RN soc/cpu/count_instr_reg_32_/RN soc/cpu/count_instr_reg_33_/RN soc/cpu/count_instr_reg_34_/RN soc/cpu/count_instr_reg_35_/RN soc/cpu/count_instr_reg_36_/RN soc/cpu/count_instr_reg_37_/RN soc/cpu/count_instr_reg_38_/RN soc/cpu/count_instr_reg_39_/RN soc/cpu/count_instr_reg_40_/RN soc/cpu/count_instr_reg_41_/RN soc/cpu/count_instr_reg_42_/RN soc/cpu/count_instr_reg_43_/RN soc/cpu/count_instr_reg_44_/RN soc/cpu/count_instr_reg_45_/RN soc/cpu/count_instr_reg_46_/RN soc/cpu/count_instr_reg_47_/RN soc/cpu/count_instr_reg_48_/RN soc/cpu/count_instr_reg_49_/RN soc/cpu/count_instr_reg_50_/RN soc/cpu/count_instr_reg_51_/RN soc/cpu/count_instr_reg_52_/RN soc/cpu/count_instr_reg_53_/RN soc/cpu/count_instr_reg_54_/RN soc/cpu/count_instr_reg_55_/RN soc/cpu/count_instr_reg_56_/RN soc/cpu/count_instr_reg_57_/RN soc/cpu/count_instr_reg_58_/RN soc/cpu/count_instr_reg_59_/RN soc/cpu/count_instr_reg_60_/RN soc/cpu/count_instr_reg_61_/RN soc/cpu/count_instr_reg_62_/RN soc/cpu/instr_jalr_reg/RN soc/cpu/irq_active_reg/RN soc/cpu/is_lui_auipc_jal_jalr_addi_add_sub_reg/RN soc/simpleuart/cfg_divider_reg_1_/RN soc/simpleuart/cfg_divider_reg_2_/RN soc/simpleuart/cfg_divider_reg_4_/RN soc/simpleuart/cfg_divider_reg_5_/RN soc/simpleuart/cfg_divider_reg_6_/RN soc/simpleuart/cfg_divider_reg_7_/RN soc/simpleuart/cfg_divider_reg_8_/RN soc/simpleuart/cfg_divider_reg_9_/RN soc/simpleuart/cfg_divider_reg_10_/RN soc/simpleuart/cfg_divider_reg_11_/RN soc/simpleuart/cfg_divider_reg_12_/RN soc/simpleuart/cfg_divider_reg_16_/RN soc/simpleuart/cfg_divider_reg_21_/RN soc/simpleuart/cfg_divider_reg_23_/RN soc/simpleuart/cfg_divider_reg_24_/RN soc/simpleuart/cfg_divider_reg_25_/RN soc/simpleuart/cfg_divider_reg_28_/RN soc/simpleuart/cfg_divider_reg_31_/RN soc/simpleuart/recv_buf_data_reg_0_/RN soc/simpleuart/recv_buf_data_reg_1_/RN soc/simpleuart/recv_buf_data_reg_2_/RN soc/simpleuart/recv_buf_data_reg_3_/RN soc/simpleuart/recv_buf_data_reg_4_/RN soc/simpleuart/recv_buf_data_reg_5_/RN soc/simpleuart/recv_buf_data_reg_6_/RN soc/simpleuart/recv_buf_data_reg_7_/RN soc/simpleuart/recv_divcnt_reg_0_/RN soc/simpleuart/recv_divcnt_reg_1_/RN soc/simpleuart/recv_divcnt_reg_3_/RN soc/simpleuart/recv_divcnt_reg_23_/RN soc/simpleuart/recv_pattern_reg_0_/RN soc/simpleuart/recv_pattern_reg_1_/RN soc/simpleuart/recv_pattern_reg_2_/RN soc/simpleuart/recv_pattern_reg_3_/RN soc/simpleuart/recv_pattern_reg_4_/RN soc/simpleuart/recv_pattern_reg_5_/RN soc/simpleuart/recv_pattern_reg_6_/RN soc/simpleuart/recv_pattern_reg_7_/RN soc/simpleuart/recv_state_reg_2_/RN soc/simpleuart/send_bitcnt_reg_0_/RN soc/simpleuart/send_bitcnt_reg_1_/RN soc/simpleuart/send_bitcnt_reg_2_/RN soc/simpleuart/send_bitcnt_reg_3_/RN soc/simpleuart/cfg_divider_reg_3_/RN soc/simpleuart/cfg_divider_reg_13_/RN soc/simpleuart/cfg_divider_reg_14_/RN soc/simpleuart/cfg_divider_reg_15_/RN soc/simpleuart/cfg_divider_reg_17_/RN soc/simpleuart/cfg_divider_reg_18_/RN soc/simpleuart/cfg_divider_reg_19_/RN soc/simpleuart/cfg_divider_reg_20_/RN soc/simpleuart/cfg_divider_reg_22_/RN soc/simpleuart/cfg_divider_reg_26_/RN soc/simpleuart/cfg_divider_reg_27_/RN soc/simpleuart/cfg_divider_reg_29_/RN soc/simpleuart/cfg_divider_reg_30_/RN soc/simpleuart/recv_buf_valid_reg/RN soc/simpleuart/recv_divcnt_reg_2_/RN soc/simpleuart/recv_divcnt_reg_4_/RN soc/simpleuart/recv_divcnt_reg_5_/RN}]
append_to_collection __coll_3 [get_pins {soc/simpleuart/recv_divcnt_reg_6_/RN soc/simpleuart/recv_divcnt_reg_7_/RN soc/simpleuart/recv_divcnt_reg_8_/RN soc/simpleuart/recv_divcnt_reg_9_/RN soc/simpleuart/recv_divcnt_reg_10_/RN soc/simpleuart/recv_divcnt_reg_11_/RN soc/simpleuart/recv_divcnt_reg_12_/RN soc/simpleuart/recv_divcnt_reg_13_/RN soc/simpleuart/recv_divcnt_reg_14_/RN soc/simpleuart/recv_divcnt_reg_15_/RN soc/simpleuart/recv_divcnt_reg_16_/RN soc/simpleuart/recv_divcnt_reg_17_/RN soc/simpleuart/recv_divcnt_reg_18_/RN soc/simpleuart/recv_divcnt_reg_19_/RN soc/simpleuart/recv_divcnt_reg_20_/RN soc/simpleuart/recv_divcnt_reg_21_/RN soc/simpleuart/recv_divcnt_reg_22_/RN soc/simpleuart/recv_divcnt_reg_24_/RN soc/simpleuart/recv_divcnt_reg_25_/RN soc/simpleuart/recv_divcnt_reg_26_/RN soc/simpleuart/recv_divcnt_reg_27_/RN soc/simpleuart/recv_divcnt_reg_28_/RN soc/simpleuart/recv_divcnt_reg_29_/RN soc/simpleuart/recv_divcnt_reg_30_/RN soc/simpleuart/recv_divcnt_reg_31_/RN soc/simpleuart/recv_state_reg_0_/RN soc/simpleuart/recv_state_reg_1_/RN soc/simpleuart/recv_state_reg_3_/RN soc/simpleuart/send_divcnt_reg_0_/RN soc/simpleuart/send_divcnt_reg_1_/RN soc/simpleuart/send_divcnt_reg_2_/RN soc/simpleuart/send_divcnt_reg_3_/RN soc/simpleuart/send_divcnt_reg_4_/RN soc/simpleuart/send_divcnt_reg_5_/RN soc/simpleuart/send_divcnt_reg_6_/RN soc/simpleuart/send_divcnt_reg_7_/RN soc/simpleuart/send_divcnt_reg_8_/RN soc/simpleuart/send_divcnt_reg_9_/RN soc/simpleuart/send_divcnt_reg_10_/RN soc/simpleuart/send_divcnt_reg_11_/RN soc/simpleuart/send_divcnt_reg_12_/RN soc/simpleuart/send_divcnt_reg_13_/RN soc/simpleuart/send_divcnt_reg_14_/RN soc/simpleuart/send_divcnt_reg_15_/RN soc/simpleuart/send_divcnt_reg_16_/RN soc/simpleuart/send_divcnt_reg_17_/RN soc/simpleuart/send_divcnt_reg_18_/RN soc/simpleuart/send_divcnt_reg_19_/RN soc/simpleuart/send_divcnt_reg_20_/RN soc/simpleuart/send_divcnt_reg_21_/RN soc/simpleuart/send_divcnt_reg_22_/RN soc/simpleuart/send_divcnt_reg_23_/RN soc/simpleuart/send_divcnt_reg_24_/RN soc/simpleuart/send_divcnt_reg_25_/RN soc/simpleuart/send_divcnt_reg_26_/RN soc/simpleuart/send_divcnt_reg_27_/RN soc/simpleuart/send_divcnt_reg_28_/RN soc/simpleuart/send_divcnt_reg_29_/RN soc/simpleuart/send_divcnt_reg_30_/RN soc/simpleuart/send_divcnt_reg_31_/RN soc/spimemio/xfer/count_reg_0_/RN soc/spimemio/xfer/count_reg_1_/RN soc/spimemio/xfer/count_reg_2_/RN soc/spimemio/xfer/count_reg_3_/RN soc/spimemio/xfer/dummy_count_reg_0_/RN soc/spimemio/xfer/dummy_count_reg_1_/RN soc/spimemio/xfer/dummy_count_reg_2_/RN soc/spimemio/xfer/dummy_count_reg_3_/RN soc/spimemio/xfer/flash_clk_reg/RN soc/spimemio/xfer/xfer_ddr_reg/RN soc/spimemio/xfer/xfer_dspi_reg/RN soc/spimemio/xfer/xfer_qspi_reg/RN soc/spimemio/xfer/xfer_rd_reg/RN soc/spimemio/xfer/xfer_tag_reg_0_/RN soc/spimemio/xfer/xfer_tag_reg_1_/RN soc/spimemio/xfer/xfer_tag_reg_2_/RN soc/spimemio/config_clk_reg/RN soc/spimemio/config_cont_reg/RN soc/spimemio/config_csb_reg/RN soc/spimemio/config_ddr_reg/RN soc/spimemio/config_do_reg_0_/RN soc/spimemio/config_do_reg_1_/RN soc/spimemio/config_do_reg_2_/RN soc/spimemio/config_do_reg_3_/RN soc/spimemio/config_dummy_reg_0_/RN soc/spimemio/config_dummy_reg_1_/RN soc/spimemio/config_dummy_reg_2_/RN soc/spimemio/config_oe_reg_0_/RN soc/spimemio/config_oe_reg_1_/RN soc/spimemio/config_oe_reg_2_/RN soc/spimemio/config_oe_reg_3_/RN soc/spimemio/din_ddr_reg/RN soc/spimemio/din_qspi_reg/RN soc/spimemio/din_rd_reg/RN soc/spimemio/din_tag_reg_0_/RN soc/spimemio/din_tag_reg_1_/RN soc/spimemio/din_tag_reg_2_/RN soc/spimemio/din_valid_reg/RN soc/spimemio/rd_inc_reg/RN soc/spimemio/rd_wait_reg/RN soc/spimemio/xfer_io0_90_reg/RN soc/spimemio/xfer_io1_90_reg/RN soc/spimemio/xfer_io2_90_reg/RN soc/spimemio/xfer_io3_90_reg/RN soc/spimemio/xfer_resetn_reg/RN soc/spimemio/config_qspi_reg/RN soc/spimemio/rd_valid_reg/RN soc/spimemio/state_reg_0_/RN soc/spimemio/state_reg_1_/RN soc/spimemio/state_reg_2_/RN soc/spimemio/state_reg_3_/RN soc/simpleuart/cfg_divider_reg_0_/SN soc/simpleuart/send_pattern_reg_0_/SN soc/simpleuart/send_pattern_reg_1_/SN soc/simpleuart/send_pattern_reg_2_/SN soc/simpleuart/send_pattern_reg_3_/SN soc/simpleuart/send_pattern_reg_4_/SN soc/simpleuart/send_pattern_reg_5_/SN soc/simpleuart/send_pattern_reg_6_/SN soc/simpleuart/send_pattern_reg_7_/SN soc/simpleuart/send_pattern_reg_8_/SN soc/simpleuart/send_dummy_reg/SN soc/spimemio/xfer/fetch_reg/SN soc/spimemio/xfer/flash_csb_reg/SN soc/spimemio/xfer/last_fetch_reg/SN soc/spimemio/config_dummy_reg_3_/SN soc/spimemio/config_en_reg/SN soc/spimemio/xfer_io0_90_reg/SN soc/spimemio/xfer_io1_90_reg/SN soc/spimemio/xfer_io2_90_reg/SN soc/spimemio/xfer_io3_90_reg/SN soc/spimemio/softreset_reg/SN}]
set_false_path -hold  -to $__coll_3  
