# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.10-p002_1 on Thu Apr 09 17:48:37 CEST 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design et4351

create_clock -name "clk" -period 83.33 -waveform {0.0 41.665} [get_ports clk]
create_generated_clock -name "flash_clk" -divide_by 2     -source [get_ports clk]   [get_ports flash_clk] 
set_load -pin_load 0.05 [get_ports ser_tx]
set_load -pin_load 0.05 [get_ports flash_csb]
set_load -pin_load 0.05 [get_ports flash_clk]
set_load -pin_load 0.05 [get_ports flash_io0]
set_load -pin_load 0.05 [get_ports flash_io1]
set_load -pin_load 0.05 [get_ports flash_io2]
set_load -pin_load 0.05 [get_ports flash_io3]
set_false_path -to [get_ports ser_tx]
set_false_path -from [list \
  [get_ports resetn]  \
  [get_ports ser_rx] ]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks flash_clk] -add_delay -max 25.8325 [get_ports flash_io0]
set_input_delay -clock [get_clocks flash_clk] -add_delay -max 25.8325 [get_ports flash_io0]
set_input_delay -clock [get_clocks flash_clk] -add_delay -max 25.8325 [get_ports flash_io1]
set_input_delay -clock [get_clocks flash_clk] -add_delay -max 25.8325 [get_ports flash_io1]
set_input_delay -clock [get_clocks flash_clk] -add_delay -max 25.8325 [get_ports flash_io2]
set_input_delay -clock [get_clocks flash_clk] -add_delay -max 25.8325 [get_ports flash_io2]
set_input_delay -clock [get_clocks flash_clk] -add_delay -max 25.8325 [get_ports flash_io3]
set_input_delay -clock [get_clocks flash_clk] -add_delay -max 25.8325 [get_ports flash_io3]
set_input_delay -clock [get_clocks flash_clk] -add_delay -min 20.8325 [get_ports flash_io0]
set_input_delay -clock [get_clocks flash_clk] -add_delay -min 20.8325 [get_ports flash_io0]
set_input_delay -clock [get_clocks flash_clk] -add_delay -min 20.8325 [get_ports flash_io1]
set_input_delay -clock [get_clocks flash_clk] -add_delay -min 20.8325 [get_ports flash_io1]
set_input_delay -clock [get_clocks flash_clk] -add_delay -min 20.8325 [get_ports flash_io2]
set_input_delay -clock [get_clocks flash_clk] -add_delay -min 20.8325 [get_ports flash_io2]
set_input_delay -clock [get_clocks flash_clk] -add_delay -min 20.8325 [get_ports flash_io3]
set_input_delay -clock [get_clocks flash_clk] -add_delay -min 20.8325 [get_ports flash_io3]
set_output_delay -clock [get_clocks flash_clk] -add_delay -max 5.0 [get_ports flash_io0]
set_output_delay -clock [get_clocks flash_clk] -add_delay -max 5.0 [get_ports flash_io0]
set_output_delay -clock [get_clocks flash_clk] -add_delay -max 5.0 [get_ports flash_io1]
set_output_delay -clock [get_clocks flash_clk] -add_delay -max 5.0 [get_ports flash_io1]
set_output_delay -clock [get_clocks flash_clk] -add_delay -max 5.0 [get_ports flash_io2]
set_output_delay -clock [get_clocks flash_clk] -add_delay -max 5.0 [get_ports flash_io2]
set_output_delay -clock [get_clocks flash_clk] -add_delay -max 5.0 [get_ports flash_io3]
set_output_delay -clock [get_clocks flash_clk] -add_delay -max 5.0 [get_ports flash_io3]
set_output_delay -clock [get_clocks flash_clk] -add_delay -min 0.0 [get_ports flash_io0]
set_output_delay -clock [get_clocks flash_clk] -add_delay -min 0.0 [get_ports flash_io0]
set_output_delay -clock [get_clocks flash_clk] -add_delay -min 0.0 [get_ports flash_io1]
set_output_delay -clock [get_clocks flash_clk] -add_delay -min 0.0 [get_ports flash_io1]
set_output_delay -clock [get_clocks flash_clk] -add_delay -min 0.0 [get_ports flash_io2]
set_output_delay -clock [get_clocks flash_clk] -add_delay -min 0.0 [get_ports flash_io2]
set_output_delay -clock [get_clocks flash_clk] -add_delay -min 0.0 [get_ports flash_io3]
set_output_delay -clock [get_clocks flash_clk] -add_delay -min 0.0 [get_ports flash_io3]
set_output_delay -clock [get_clocks flash_clk] -add_delay -max 5.0 [get_ports flash_csb]
set_output_delay -clock [get_clocks flash_clk] -add_delay -min 0.0 [get_ports flash_csb]
set_max_transition 0.28 [current_design]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -pin "Y" [get_ports clk]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -pin "Y" [get_ports resetn]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -pin "Y" [get_ports ser_rx]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -pin "Y" [get_ports flash_io0]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -pin "Y" [get_ports flash_io1]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -pin "Y" [get_ports flash_io2]
set_driving_cell -lib_cell INVX1 -library slow_vdd1v0 -pin "Y" [get_ports flash_io3]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFHQX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFHQX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFHQX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFHQX8]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFNSRX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFNSRX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFNSRX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFNSRXL]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFQX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFQX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFQX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFQXL]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFRHQX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFRHQX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFRHQX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFRHQX8]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFRX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFRX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFRX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFRXL]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSHQX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSHQX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSHQX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSHQX8]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSRHQX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSRHQX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSRHQX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSRHQX8]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSRX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSRX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSRX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSRXL]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSXL]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFTRX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFTRX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFTRX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFTRXL]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFXL]
set_dont_use true [get_lib_cells slow_vdd1v0/SEDFFHQX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SEDFFHQX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SEDFFHQX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SEDFFHQX8]
set_dont_use true [get_lib_cells slow_vdd1v0/SEDFFTRX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SEDFFTRX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SEDFFTRX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SEDFFTRXL]
set_dont_use true [get_lib_cells slow_vdd1v0/SEDFFX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SEDFFX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SEDFFX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SEDFFXL]
set_dont_use true [get_lib_cells slow_vdd1v0/SMDFFHQX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SMDFFHQX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SMDFFHQX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SMDFFHQX8]
set_clock_uncertainty -setup 0.1 [get_clocks clk]
set_clock_uncertainty -hold 0.1 [get_clocks clk]
set_clock_uncertainty -setup 0.1 [get_clocks flash_clk]
set_clock_uncertainty -hold 0.1 [get_clocks flash_clk]
